<template><div><h2 id="класс-metric" tabindex="-1"><a class="header-anchor" href="#класс-metric"><span>Класс <code v-pre>Metric</code></span></a></h2>
<p>Обрабатывайте вспомогательные значения и рассчитывайте срезы аналитики.</p>
<p>По сути, метрика - это строка в ежедневном отчете.</p>
<h3 id="атрибуты" tabindex="-1"><a class="header-anchor" href="#атрибуты"><span>Атрибуты</span></a></h3>
<ul>
<li><code v-pre>metric_name</code> — строковое значение имени определенной метрики</li>
<li><code v-pre>table_name</code> — строковое значение имени таблицы, которое содержит
определенный показатель</li>
<li><code v-pre>column_name</code> — строковое значение имени столбца, которое содержит
определенный показатель</li>
<li><code v-pre>priority</code> — целочисленное значение представляет порядок строк метрики
в отчете.</li>
<li><code v-pre>product_id</code> — целочисленное значение определяет идентификатор продукта, к которому
относится конкретная метрика.</li>
<li><code v-pre>threshold_rate</code> — значение с плавающей запятой или целое число для порогового значения
показателя, при котором значение показателя окрашивается в
определенного цвета.</li>
<li><code v-pre>tech_measure</code> — строковое значение для математического представления
какого-либо показателя, например в миллионах или процентах.</li>
<li><code v-pre>is_important</code> — логическое значение указывает, соответствует ли метрика
строка должна быть выделена жирным шрифтом.</li>
<li><code v-pre>aggregate_function</code> — наименование агрегирующей функции, как в SQL</li>
<li><code v-pre>less_is_better</code> — логическое значение указывает, что значения показателя
должны быть выделены положительным цветом, пока их динамика
уменьшается.</li>
<li><code v-pre>filters</code> — список выражений фильтра для показателя.</li>
<li><code v-pre>business_measure</code> — строковое значение, определяющее единицы
измерения, например, units и т.д.</li>
<li><code v-pre>comparison_slices</code> — список имен аналитических срезов для сравнения</li>
<li><code v-pre>cumulative_slices</code> — список имен совокупных аналитических срезов.</li>
</ul>
<h3 id="своиства" tabindex="-1"><a class="header-anchor" href="#своиства"><span>Свойства</span></a></h3>
<h3 id="методы" tabindex="-1"><a class="header-anchor" href="#методы"><span>Методы</span></a></h3>
</div></template>


